Revit 2027 API
FileExportedEventArgs.Path Property
 Target path for the exported file (or files).
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Path { get; }
Public ReadOnly Property Path As String
	Get
public:
property String^ Path {
	String^ get ();
}
member Path : string with get
Property Value
String
Remarks
 In some cases the path represents only the target directory or a template name. Such cases include batch export when more than one file is exported as one event.
See Also
Reference
FileExportedEventArgs Class
Autodesk.Revit.DB.Events Namespace